import './2ndscreen.css'
import LineChart from '../LineChart/LineChart';
import TableChart from '../TableChart/TableChart';
import Header from '../Header/Header';
import Navbar from '../Navbar/Navbar';
import MainTable from '../MainTable/MainTable';

const columns = [
    { id: 'date', label: 'Дата', minWidth: 50 },
    { id: 'shop', label: 'ТК', minWidth: 50 },
    { id: 'group', label: 'Группа', minWidth: 100 },
    { id: 'category', label: 'Категория', minWidth: 100 },
    { id: 'subcategory', label: 'Подкатегория', minWidth: 100 },
    { id: 'SKU', label: 'SKU', minWidth: 100 },
    { id: 'product', label: 'Товар', minWidth: 100 },
    { id: 'unit', label: 'Ед.изм.', minWidth: 100 },
    { id: 'sale', label: 'Продажа, ед.', minWidth: 100 },
    { id: 'forecast', label: 'Прогноз, ед.', minWidth: 100 },
    { id: 'difference', label: 'Разница продажа и прогноз', minWidth: 100, align: 'center' },
    { id: 'quality', label: 'Качество прогноза по WAPE', minWidth: 100, align: 'center' },
]

function createData(date, shop, group, category, subcategory, SKU, product, unit, sale, forecast, difference, quality) {
    return { date, shop, group, category, subcategory, SKU, product, unit, sale, forecast, difference, quality };
}


const rows = [
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434691', 'Булочка с маком', 'шт', 65, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434692', 'Булочка с повидлом', 'шт', 93, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434693', 'Булочка с кунжутом', 'шт', 75, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434694', 'Булочка с творогом', 'шт', 74, 12, 12, 12),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434695', 'Булочка с семенами льна', 'шт', 93, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434691', 'Булочка с маком', 'шт', 65, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434692', 'Булочка с повидлом', 'шт', 93, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434693', 'Булочка с кунжутом', 'шт', 75, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434694', 'Булочка с творогом', 'шт', 74, 12, 12, 12),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434695', 'Булочка с семенами льна', 'шт', 93, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434691', 'Булочка с маком', 'шт', 65, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434692', 'Булочка с повидлом', 'шт', 93, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434693', 'Булочка с кунжутом', 'шт', 75, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434694', 'Булочка с творогом', 'шт', 74, 12, 12, 12),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434695', 'Булочка с семенами льна', 'шт', 93, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434691', 'Булочка с маком', 'шт', 65, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434692', 'Булочка с повидлом', 'шт', 93, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434693', 'Булочка с кунжутом', 'шт', 75, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434694', 'Булочка с творогом', 'шт', 74, 12, 12, 12),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434695', 'Булочка с семенами льна', 'шт', 93, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434691', 'Булочка с маком', 'шт', 65, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434692', 'Булочка с повидлом', 'шт', 93, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434693', 'Булочка с кунжутом', 'шт', 75, 5, 5, 5),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434694', 'Булочка с творогом', 'шт', 74, 12, 12, 12),
    createData('12.04-18.04.23', 123, 'Хлеб', 'Хлеб мелкоштучный', 'Булочки', '434695', 'Булочка с семенами льна', 'шт', 93, 5, 5, 5),
];


function SecondScreen() {
    return (
        <>
            <Navbar />
            <div className='secondscreen'>
                <Header></Header>
                <LineChart></LineChart>
                <TableChart></TableChart>
                <MainTable columns={columns} rows={rows}></MainTable>
            </div>
        </>
    )
}

export default SecondScreen